# Checking database tables

In [11]:
import sqlite3
import pandas as pd
import os

# Optional: import display() if running in Jupyter
try:
    from IPython.display import display
except ImportError:
    display = print  # Fallback to print if not in Jupyter

# Paths
db_path = os.path.join('..', '1_Schema_Design', 'retail.db')
sql_path = os.path.join(os.getcwd(), 'schema_design.sql')  # adjust if needed

# Connect to the database
conn = sqlite3.connect(db_path)
cursor = conn.cursor()

# Run schema SQL
with open(sql_path, 'r', encoding='utf-8') as sql_file:
    sql_script = sql_file.read()

# Drop tables if they exist to avoid duplicate insert errors
cursor.executescript("""
DROP TABLE IF EXISTS FactSales;
DROP TABLE IF EXISTS DimTime;
DROP TABLE IF EXISTS DimProduct;
DROP TABLE IF EXISTS DimCustomer;
""")

# Execute the SQL script
cursor.executescript(sql_script)
conn.commit()

# Verify data for the 4 tables you have
for table in ['DimTime', 'DimProduct', 'DimCustomer', 'FactSales']:
    print(f"\n=== {table} ===")
    df = pd.read_sql_query(f"SELECT * FROM {table} LIMIT 5;", conn)
    display(df)

# Show all tables and their schema
print("\nTables in the database:")
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
for (table_name,) in cursor.fetchall():
    print(f"\n=== {table_name} ===")
    df = pd.read_sql_query(f"SELECT * FROM {table_name} LIMIT 5;", conn)
    display(df)

    print("\nSchema:")
    cursor.execute(f"PRAGMA table_info({table_name})")
    for column in cursor.fetchall():
        print(f"Column: {column[1]}, Type: {column[2]}")
    print("-" * 50)

# Close connection
conn.close()

=== DimTime ===

   TimeID InvoiceDate  Day  Month  Quarter  Year
0       1  2025-01-01    1      1        1  2025
1       2  2025-01-15   15      1        1  2025
2       3  2025-02-01    1      2        1  2025
3       4  2025-03-15   15      3        1  2025
4       5  2025-04-01    1      4        2  2025

=== DimProduct ===

   ProductID StockCode   Description     Category
0          1      P001        Laptop  Electronics
1          2      P002    Smartphone  Electronics
2          3      P003       T-Shirt     Clothing
3          4      P004         Jeans     Clothing
4          5      P005  Coffee Maker   Appliances

=== DimCustomer ===

   CustomerID    Country
0        1001        USA
1        1002         UK
2        1003     Canada
3        1004  Australia
4        1005    Germany

=== FactSales ===

,SalesID,InvoiceNo,Quantity,UnitPrice,TotalSales,TimeID,ProductID,CustomerID
0,1,INV001,2,999.99,1999.98,1,1,1001
1,2,INV002,1,699.99,699.99,2,2,1002
2,3,INV003,3,29.99,89.97,3,3,1003
3,4,INV004,2,79.99,159.98,4,4,1004
4,5,INV005,1,89.99,89.99,5,5,1005

Tables in the database:

=== sqlite_sequence ===

         name  seq
0     DimTime   15
1  DimProduct   15
2   FactSales   15

Schema:
Column: name, Type:
Column: seq, Type:
--------------------------------------------------

=== DimTime ===

   TimeID InvoiceDate  Day  Month  Quarter  Year
0       1  2025-01-01    1      1        1  2025
1       2  2025-01-15   15      1        1  2025
2       3  2025-02-01    1      2        1  2025
3       4  2025-03-15   15      3        1  2025
4       5  2025-04-01    1      4        2  2025

Schema:
Column: TimeID, Type: INTEGER
Column: InvoiceDate, Type: TEXT
Column: Day, Type: INTEGER
Column: Month, Type: INTEGER
Column: Quarter, Type: INTEGER
Column: Year, Type: INTEGER
--------------------------------------------------

=== DimProduct ===

   ProductID StockCode   Description     Category
0          1      P001        Laptop  Electronics
1          2      P002    Smartphone  Electronics
2          3      P003       T-Shirt     Clothing
3          4      P004         Jeans     Clothing
4          5      P005  Coffee Maker   Appliances

Schema:
Column: ProductID, Type: INTEGER
Column: StockCode, Type: TEXT
Column: Description, Type: TEXT
Column: Category, Type: TEXT
--------------------------------------------------

=== DimCustomer ===

   CustomerID    Country
0        1001        USA
1        1002         UK
2        1003     Canada
3        1004  Australia
4        1005    Germany

Schema:
Column: CustomerID, Type: INTEGER
Column: Country, Type: TEXT
--------------------------------------------------

=== FactSales ===

,SalesID,InvoiceNo,Quantity,UnitPrice,TotalSales,TimeID,ProductID,CustomerID
0,1,INV001,2,999.99,1999.98,1,1,1001
1,2,INV002,1,699.99,699.99,2,2,1002
2,3,INV003,3,29.99,89.97,3,3,1003
3,4,INV004,2,79.99,159.98,4,4,1004
4,5,INV005,1,89.99,89.99,5,5,1005

Schema:
Column: SalesID, Type: INTEGER
Column: InvoiceNo, Type: TEXT
Column: Quantity, Type: INTEGER
Column: UnitPrice, Type: REAL
Column: TotalSales, Type: REAL
Column: TimeID, Type: INTEGER
Column: ProductID, Type: INTEGER
Column: CustomerID, Type: INTEGER
--------------------------------------------------